{"format": "layers-model", "generatedBy": "keras v2.15.0", "convertedBy": "TensorFlow.js Converter v4.20.0", "modelTopology": {"keras_version": "2.15.0", "model_config": {"class_name": "Sequential", "config": {"name": "tf_dnn", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_layer"}}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": "float32", "units": 64, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "build_config": {"input_shape": [null, 3]}}, {"class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "dtype": "float32", "units": 32, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "build_config": {"input_shape": [null, 64]}}, {"class_name": "Dense", "config": {"name": "output_layer", "trainable": true, "dtype": "float32", "units": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "build_config": {"input_shape": [null, 32]}}]}, "build_config": {"input_shape": [null, 3]}, "compile_config": {"optimizer": {"class_name": "Adam", "config": {"name": "Adam", "weight_decay": null, "clipnorm": null, "global_clipnorm": null, "clipvalue": null, "use_ema": false, "ema_momentum": 0.99, "ema_overwrite_frequency": null, "jit_compile": true, "is_legacy_optimizer": false, "learning_rate": 0.0010000000474974513, "beta_1": 0.9, "beta_2": 0.999, "epsilon": 1e-07, "amsgrad": false}}, "loss": "mean_squared_error", "metrics": null, "loss_weights": null, "weighted_metrics": null, "run_eagerly": null, "steps_per_execution": null, "jit_compile": null}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "layers/dense/vars/0", "shape": [3, 64], "dtype": "float32"}, {"name": "layers/dense/vars/1", "shape": [64], "dtype": "float32"}, {"name": "layers/dense_1/vars/0", "shape": [64, 32], "dtype": "float32"}, {"name": "layers/dense_1/vars/1", "shape": [32], "dtype": "float32"}, {"name": "layers/dense_2/vars/0", "shape": [32, 1], "dtype": "float32"}, {"name": "layers/dense_2/vars/1", "shape": [1], "dtype": "float32"}, {"name": "metrics/mean/vars/0", "shape": [], "dtype": "float32"}, {"name": "metrics/mean/vars/1", "shape": [], "dtype": "float32"}, {"name": "optimizer/vars/0", "shape": [], "dtype": "int32"}, {"name": "optimizer/vars/1", "shape": [3, 64], "dtype": "float32"}, {"name": "optimizer/vars/10", "shape": [32, 1], "dtype": "float32"}, {"name": "optimizer/vars/11", "shape": [1], "dtype": "float32"}, {"name": "optimizer/vars/12", "shape": [1], "dtype": "float32"}, {"name": "optimizer/vars/2", "shape": [3, 64], "dtype": "float32"}, {"name": "optimizer/vars/3", "shape": [64], "dtype": "float32"}, {"name": "optimizer/vars/4", "shape": [64], "dtype": "float32"}, {"name": "optimizer/vars/5", "shape": [64, 32], "dtype": "float32"}, {"name": "optimizer/vars/6", "shape": [64, 32], "dtype": "float32"}, {"name": "optimizer/vars/7", "shape": [32], "dtype": "float32"}, {"name": "optimizer/vars/8", "shape": [32], "dtype": "float32"}, {"name": "optimizer/vars/9", "shape": [32, 1], "dtype": "float32"}]}]}