{
  "format": "layers-model",
  "generatedBy": "TensorFlow.js Converter v4.20.0",
  "convertedBy": "TensorFlow.js Converter v4.20.0",
  "modelTopology": {
    "class_name": "Sequential",
    "config": {
      "name": "sequential",
      "layers": [
        {
          "class_name": "Dense",
          "config": {
            "name": "dense",
            "trainable": true,
            "batch_input_shape": [null, 3],
            "dtype": "float32",
            "units": 64,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "GlorotUniform",
              "config": {
                "seed": null
              }
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
          }
        },
        {
          "class_name": "Dense",
          "config": {
            "name": "dense_1",
            "trainable": true,
            "dtype": "float32",
            "units": 32,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "GlorotUniform",
              "config": {
                "seed": null
              }
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
          }
        },
        {
          "class_name": "Dense",
          "config": {
            "name": "dense_2",
            "trainable": true,
            "dtype": "float32",
            "units": 1,
            "activation": "linear",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "GlorotUniform",
              "config": {
                "seed": null
              }
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
          }
        }
      ]
    }
  },



"weightsManifest": [
	  {
		      "paths": ["group1-shard1of1.bin"],
		          "weights": [
				        {
						        "name": "layers/dense/vars/0",
							        "shape": [3, 64],
								        "dtype": "float32"
									      },
									            {
											            "name": "layers/dense/vars/1",
												            "shape": [64],
													            "dtype": "float32"
														          },
															        {
																	        "name": "layers/dense_1/vars/0",
																		        "shape": [64, 32],
																			        "dtype": "float32"
																				      },
																				            {
																						            "name": "layers/dense_1/vars/1",
																							            "shape": [32],
																								            "dtype": "float32"
																									          },
																										        {
																												        "name": "layers/dense_2/vars/0",
																													        "shape": [32, 1],
																														        "dtype": "float32"
																															      },
																															            {
																																	            "name": "layers/dense_2/vars/1",
																																		            "shape": [1],
																																			            "dtype": "float32"
																																				          }
																																					      ]
																																					        }
]


}

